20260206T084149--kdoc-544-使っているchrome拡張を列挙する__essay.org
:properties:
:ID: 20260206T084149
:end:
#+title:      KDOC 544: 使っているChrome拡張を列挙する
#+date:       [2026-02-06 Fri 08:41]
#+filetags:   :essay:
#+identifier: 20260206T084149

* この文書のステータス
- 作成
  - [X] 2026-02-11 貴島
- レビュー
  - [X] 2026-02-11 貴島

* 概要

仕事などで新しくPCを設定するときには、Chrome拡張を手動でインストールしている。一覧をメモしておく。

- Auto Copy
  - ドラッグして選択したら自動でコピーされる。現在のディスプレイマネージャーだとChromeのコピーがキーボードでしづらいので必要
- Chrome Capture - Screenshot & GIF
  - GIFで撮影できる。ファイルをローカルにダウンロードしないといけないのが不満。ファイルをコピー&ペーストしたい
- Create Link
  - 各ページをMarkdownやOrgのリンク記法でコピーできる
- DeepL: translate and write with AI
  - ドラッグして日本語訳できる
- MaxFocus: Link Preview & AI Assistant
  - タブ内で別のページを開ける。Notionで大量のドキュメントを漁るときに必須
- Reader Line
  - しっかり注意深く読みたいとき、カーソル周辺を隠して流し読みしないようにしている
- Screenshot Tool - Screen Capture & Editor
  - たくさんあるキャプチャツールのなかでもっとも使いやすい。撮ったあとフリーハンドで少し図を入れて、クリップボードにコピーして貼る、が統合されておりスムーズにできる
- Unhook - Remove YouTube Recommended & Shorts
  - 不必要な情報が目に入らないようにしている
- uBlacklist
  - 不必要な情報が目に入らないようにしている

* 関連

なし。
