20260206T084149--kdoc-544-使っているchrome拡張を列挙する__essay.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-02-26T09:16:02Z -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>KDOC 544: 使っているChrome拡張を列挙する</title>
<meta name="author" content="kijimaD" />
<meta name="generator" content="Org Mode" />
<link rel='shortcut icon' type='image/x-icon' href='https://kijimad.github.io/roam/favicon.ico' /><link rel='stylesheet' href='https://cdn.jsdelivr.net/npm/bootstrap@5.3.3/dist/css/bootstrap.min.css' media='print' onload='this.media="all"' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/site.css' /><link rel='stylesheet' href='https://kijimad.github.io/roam/css/code.css' /><link rel='preconnect' href='https://fonts.googleapis.com'><link rel='preconnect' href='https://fonts.gstatic.com' crossorigin><link href='https://fonts.googleapis.com/css2?family=IBM+Plex+Sans+JP&display=swap' rel='stylesheet'>
</head>
<body>
<div id="preamble" class="status">
<div><div class="header"><div class="container"><div class="row"><div class="col-sm-12 col-md-12"><nav class="navbar navbar-light"/></div></div></div></div></div>
</div>
<div id="content" class="content">
<h1 class="title">KDOC 544: 使っているChrome拡張を列挙する</h1>
<div id="outline-container-org8ff779b" class="outline-2">
<h2 id="org8ff779b"><a href="#org8ff779b">この文書のステータス</a></h2>
<div class="outline-text-2" id="text-org8ff779b">
<ul class="org-ul">
<li>作成
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-11 貴島</li>
</ul></li>
<li>レビュー
<ul class="org-ul">
<li class="on"><input type='checkbox' checked='checked' /> 2026-02-11 貴島</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org8034dad" class="outline-2">
<h2 id="org8034dad"><a href="#org8034dad">概要</a></h2>
<div class="outline-text-2" id="text-org8034dad">
<p>
仕事などで新しくPCを設定するときには、Chrome拡張を手動でインストールしている。一覧をメモしておく。
</p>

<ul class="org-ul">
<li>Auto Copy
<ul class="org-ul">
<li>ドラッグして選択したら自動でコピーされる。現在のディスプレイマネージャーだとChromeのコピーがキーボードでしづらいので必要</li>
</ul></li>
<li>Chrome Capture - Screenshot &amp; GIF
<ul class="org-ul">
<li>GIFで撮影できる。ファイルをローカルにダウンロードしないといけないのが不満。ファイルをコピー&amp;ペーストしたい</li>
</ul></li>
<li>Create Link
<ul class="org-ul">
<li>各ページをMarkdownやOrgのリンク記法でコピーできる</li>
</ul></li>
<li>DeepL: translate and write with AI
<ul class="org-ul">
<li>ドラッグして日本語訳できる</li>
</ul></li>
<li>MaxFocus: Link Preview &amp; AI Assistant
<ul class="org-ul">
<li>タブ内で別のページを開ける。Notionで大量のドキュメントを漁るときに必須</li>
</ul></li>
<li>Reader Line
<ul class="org-ul">
<li>しっかり注意深く読みたいとき、カーソル周辺を隠して流し読みしないようにしている</li>
</ul></li>
<li>Screenshot Tool - Screen Capture &amp; Editor
<ul class="org-ul">
<li>たくさんあるキャプチャツールのなかでもっとも使いやすい。撮ったあとフリーハンドで少し図を入れて、クリップボードにコピーして貼る、が統合されておりスムーズにできる</li>
</ul></li>
<li>Unhook - Remove YouTube Recommended &amp; Shorts
<ul class="org-ul">
<li>不必要な情報が目に入らないようにしている</li>
</ul></li>
<li>uBlacklist
<ul class="org-ul">
<li>不必要な情報が目に入らないようにしている</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org682b18d" class="outline-2">
<h2 id="org682b18d"><a href="#org682b18d">関連</a></h2>
<div class="outline-text-2" id="text-org682b18d">
<p>
なし。
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer class="footer py-3"><div class="container"><div class="row "><div class="col-md-4"></div><div class="col-sm col-md"><nav class="navbar"><a class="nav-link text-secondary small px-0" href="./index.html">Insomnia</a><a class="nav-link text-secondary small px-0" href="./sitemap.html">Sitemap</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD/roam">Repository</a><a class="nav-link text-secondary small px-0" href="https://github.com/kijimaD">@kijimaD</a></nav></div><div class="col-md-4"></div></div></div></footer>
</div>
</body>
</html>
